# ordinal encoding
## Ordinal encoding is a technique to transform categorical features into a numerical format. In ordinal encoding, labels are translated to numbers based on their ordinal relationship to one another.

## what we will  doing ordinal Encoding 
## step 1 -- split data 
## step 2 -- learn to transform on train data
## step 3 -- Apply on both

In [1]:
import numpy as np
import pandas as pd

# loading dataset

In [2]:
data= pd.read_csv(r"bike_buyers_clean.csv")
data

,ID,Marital Status,Gender,Income,Children,Education,Occupation,Home Owner,Cars,Commute Distance,Region,Age,Purchased Bike
0,12496,Married,Female,40000,1,Bachelors,Skilled Manual,Yes,0,0-1 Miles,Europe,42,No
1,24107,Married,Male,30000,3,Partial College,Clerical,Yes,1,0-1 Miles,Europe,43,No
2,14177,Married,Male,80000,5,Partial College,Professional,No,2,2-5 Miles,Europe,60,No
3,24381,Single,Male,70000,0,Bachelors,Professional,Yes,1,5-10 Miles,Pacific,41,Yes
4,25597,Single,Male,30000,0,Bachelors,Clerical,No,0,0-1 Miles,Europe,36,Yes
...,...,...,...,...,...,...,...,...,...,...,...,...,...
995,23731,Married,Male,60000,2,High School,Professional,Yes,2,2-5 Miles,North America,54,Yes
996,28672,Single,Male,70000,4,Graduate Degree,Professional,Yes,0,2-5 Miles,North America,35,Yes
997,11809,Married,Male,60000,2,Bachelors,Skilled Manual,Yes,0,0-1 Miles,North America,38,Yes
998,19664,Single,Male,100000,3,Bachelors,Management,No,3,1-2 Miles,North America,38,No
999,12121,Single,Male,60000,3,High School,Professional,Yes,2,10+ Miles,North America,53,Yes

# Finding unique values from columns

In [3]:
 data['Education'].unique()

array(['Bachelors', 'Partial College', 'High School',
       'Partial High School', 'Graduate Degree'], dtype=object)

In [4]:
data["Occupation"].unique()

array(['Skilled Manual', 'Clerical', 'Professional', 'Manual',
       'Management'], dtype=object)

In [5]:
data["Region"].unique()

array(['Europe', 'Pacific', 'North America'], dtype=object)

# deleting unwantd columns

In [6]:
data2= data.drop(['ID','Marital Status','Gender','Income','Children','Home Owner','Cars','Commute Distance'], axis=1)

In [7]:
data2.head()

         Education      Occupation   Region  Age Purchased Bike
0        Bachelors  Skilled Manual   Europe   42             No
1  Partial College        Clerical   Europe   43             No
2  Partial College    Professional   Europe   60             No
3        Bachelors    Professional  Pacific   41            Yes
4        Bachelors        Clerical   Europe   36            Yes

In [8]:
data2.shape

(1000, 5)

# spliting the data into train and test data

In [10]:
from sklearn.model_selection import train_test_split
x_train, x_test, y_train,y_test=train_test_split(data2.iloc[:,0:2],data2.iloc[:,-1], test_size=0.2)

In [12]:
x_train

               Education      Occupation
305  Partial High School        Clerical
610      Partial College  Skilled Manual
88       Partial College        Clerical
754          High School    Professional
89           High School          Manual
..                   ...             ...
805          High School  Skilled Manual
939  Partial High School  Skilled Manual
657      Partial College  Skilled Manual
678            Bachelors      Management
714          High School  Skilled Manual

[800 rows x 2 columns]

In [13]:
x_test

           Education    Occupation
516      High School  Professional
187  Partial College  Professional
656      High School  Professional
534      High School  Professional
974  Graduate Degree    Management
..               ...           ...
670  Partial College  Professional
49         Bachelors      Clerical
906  Graduate Degree  Professional
467        Bachelors    Management
164  Partial College        Manual

[200 rows x 2 columns]

In [14]:
y_train

305     No
610     No
88      No
754    Yes
89     Yes
      ...
805     No
939     No
657     No
678     No
714    Yes
Name: Purchased Bike, Length: 800, dtype: object

In [15]:
y_test

516     No
187     No
656     No
534     No
974    Yes
      ...
670     No
49     Yes
906    Yes
467    Yes
164    Yes
Name: Purchased Bike, Length: 200, dtype: object

# now we import OrdinalEncoder and creating its object then pass the list containing the unique values in the order

In [17]:
from sklearn.preprocessing import OrdinalEncoder

In [18]:
oe = OrdinalEncoder(categories=[['High School', 'Partial High School', 'Partial College', 
       'Bachelors','Graduate Degree'],['Clerical',  'Manual','Skilled Manual', 'Professional',
       'Management']])

# fitthe object on train data

In [19]:
oe.fit(x_train)

OrdinalEncoder(categories=[['High School', 'Partial High School',
                            'Partial College', 'Bachelors', 'Graduate Degree'],
                           ['Clerical', 'Manual', 'Skilled Manual',
                            'Professional', 'Management']])

# transform on both

In [20]:
x_train = oe.transform(x_train)
x_test = oe.transform(x_test)

In [28]:
x_train
#print(x_train.shape)

array([[1., 0.],
       [2., 2.],
       [2., 0.],
       ...,
       [2., 2.],
       [3., 4.],
       [0., 2.]])

In [30]:
#x_test
#print(x_test.shape)

In [33]:
oe.categories_

[array(['High School', 'Partial High School', 'Partial College',
        'Bachelors', 'Graduate Degree'], dtype=object),
 array(['Clerical', 'Manual', 'Skilled Manual', 'Professional',
        'Management'], dtype=object)]

# Applying label wncoding to output column

In [34]:
from sklearn.preprocessing import LabelEncoder

In [36]:
le=LabelEncoder()

In [38]:
le.fit(y_train)

LabelEncoder()

In [39]:
le.classes_

array(['No', 'Yes'], dtype=object)

In [41]:
y_train = le.transform(y_train)
y_test = le.transform(y_test)